# encoding: UTF-8
from __future__ import division  #  正常除法，此导入必须置顶优先，否则报错

import numpy as np
import pandas as pd
from pandas import Series, DataFrame
import scipy.stats as stats
import scipy.optimize as opt

# instruments = ['m', 'rb', 'cu', 'ag', 'bu', 'a', 'c', 'CF', 'i', 'j', 'jm', 'l', 'MA', 'ni', 'p', 'pp', 'RM',
    #                'ru', 'SR', 'TA', 'y', 'zn', 'jd', 'al', 'cs', 'au', 'sn', 'hc', 'ZC', 'OI', 'v', 'pb', 'FG',
    #                'TF']
instruments = ['m', 'rb', 'cu']#需要读取的品种
periods = ['min15']#需要读取的周期
g_product_info = {'zn': ('zn', 5, 5, 0.08, 3),
                  'sn': ('sn', 1, 10, 0.08, 3),
                  'ru': ('ru', 10, 5, 0.09, 12),
                  'rb': ('rb', 10, 1, 0.09, 6),
                  'pb': ('pb', 5, 5, 0.08, 3.5),
                  'ni': ('ni', 1, 10, 0.08, 12),
                  'hc': ('hc', 10, 1, 0.08, 6),
                  'cu': ('cu', 5, 10, 0.08, 12),
                  'bu': ('bu', 10, 2, 0.08, 4.6),
                  'au': ('au', 1000, 0.05, 0.06, 10),
                  'al': ('al', 5, 5, 0.08, 3),
                  'ag': ('ag', 15, 1, 0.07, 6),
                  'y': ('y', 10, 2, 0.07, 5),
                  'v': ('v', 5, 5, 0.07, 2),
                  'pp': ('pp', 5, 1, 0.07, 10),
                  'p': ('p', 10, 2, 0.07, 5),
                  'm': ('m', 10, 1, 0.07, 3),
                  'l': ('l', 5, 5, 0.07, 4),
                  'jm': ('jm', 60, 0.5, 0.1, 43.2),
                  'jd': ('jd', 10, 1, 0.08, 12),
                  'j': ('j', 100, 0.5, 0.1, 108),
                  'i': ('i', 100, 0.5, 0.1, 22),
                  'cs': ('cs', 10, 1, 0.07, 3),
                  'c': ('c', 10, 1, 0.07, 1.2),
                  'a': ('a', 10, 1, 0.07, 4),
                  'ZC': ('ZC', 100, 0.2, 0.08, 21),
                  'WH': ('WH', 20, 1, 0.07, 2.5),
                  'TA': ('TA', 5, 2, 0.06, 3),
                  'SR': ('SR', 10, 1, 0.05, 3),
                  'SM': ('SM', 5, 2, 0.08, 9),
                  'SF': ('SF', 5, 2, 0.08, 3),
                  'RM': ('RM', 10, 1, 0.08, 5),
                  'OI': ('OI', 10, 2, 0.08, 2.5),
                  'MA': ('MA', 10, 1, 0.08, 8),
                  'FG': ('FG', 20, 1, 0.08, 27),
                  'CF': ('CF', 5, 5, 0.08, 12),
                  'TF': ('TF', 10000, 0.005, 0.012, 6),
                  'T': ('T', 10000, 0.005, 0.02, 3)
                  }# 品种属性表